const keyboards = {
    '1': [
        ['ض', 'ص', 'ث', 'ق', 'ف', 'غ', 'ع', 'ه', 'خ', 'ح', 'ج', 'د'],
        ['ش', 'س', 'ي', 'ب', 'ل', 'ا', 'ت', 'ن', 'م', 'ك', 'ط'],
        ['ئ', 'ؤ', 'ر', 'لا', 'ى', 'ة', 'و', 'ز', 'ظ', '،', '.'],
        [
            { text: '←', key: 'Backspace', width: '12.5%' },
            { text: 'Space', key: ' ', width: '52.5%' },
            { text: '123#@', key: 'Keyboard 2', width: '25%' },
            { text: '↲', key: 'Enter', width: '10%' },
        ],
    ],
    '2': [
        ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
        ['@', '#', ':', '/', '_', '-', '+', '$', '%', '&', '*'],
        ['(', ')', '[', ']', '<', '>', '~', '`', '^', 'ء', '؟'],
        [
            { text: '←', key: 'Backspace', width: '12.5%' },
            { text: 'Space', key: ' ', width: '50%' },
            { text: 'ضصث', key: 'Keyboard 1', width: '25%' },
            { text: '↲', key: 'Enter', width: '12.5%' },
        ],
    ],
};

export default keyboards;
