const keyboards = {
    '1': [
        ['ौ', 'ै', 'ा', 'ी', 'ू', 'ब', 'ह', 'ग', 'द', 'ज', 'ड'],
        ['ो', 'े', '्', 'ि', 'ु', 'प', 'र', 'क', 'त', 'च', 'ट'],
        ['ॉ', 'ं', 'म', 'न', 'व', 'ल', 'स', 'य', '।', ',', '.'],
        [
            { text: '←', key: 'Backspace', width: '12.5%' },
            { text: 'Space', key: ' ', width: '52.5%' },
            { text: 'अ123', key: 'Keyboard 2', width: '25%' },
            { text: '↲', key: 'Enter', width: '10%' },
        ],
    ],
    '2': [
        ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
        ['अ', 'आ', 'इ', 'ई', 'उ', 'ऊ', 'ए', 'ऐ', 'ओ', 'औ'],
        ['(', ')', '[', ']', '़', 'ऽ', '॥', '-', '+'],
        [
            { text: '←', key: 'Backspace', width: '12.5%' },
            { text: 'Space', key: ' ', width: '50%' },
            { text: 'कखग', key: 'Keyboard 1', width: '25%' },
            { text: '↲', key: 'Enter', width: '12.5%' },
        ],
    ],
};

export default keyboards;
